print('“王者荣耀游戏角色”游戏角色:')
print('===坦克:===')
a =['苏烈 刘邦  钟馗 张飞 牛魔 程咬金 白起 刘禅 庄周 项羽 廉颇 巨灵神 猪八戒']
print(a[0])
print('===战士:===')
b =['狂铁 恺 孙悟空 哪吒 杨戬 橘右京 亚瑟 雅典娜 夏侯淳 关羽 吕布 韩信 老夫子  达摩 典韦 曹操 钟无艳 墨子 赵云 刑天 龙且']
print(b[0])
print('===刺客:===')
c =['百里玄策 庞统 花木兰 荆轲 不知火舞 李白 娜可露露 兰陵王 露娜 韩信 宫本武藏 盖聂']
print(c[0])
print('===法师:===')
d=['杨玉环 女娲 周瑜 鬼谷子 干将莫邪 东皇太一 大乔 诸葛亮 貂蝉 张良 安其拉']
print(d[0])
print('===射手===')
e=['公孙离 百里守约 后羿 刘备 黄忠 马可波罗 成吉思汗 虞姬 李元芳 狄仁杰 鲁班 孙尚香']
print(e[0])
print('===辅助===')
f=['明世隐 梦琪 孙膑 太乙真人 蔡文姬']
print(f[0])

