A = input('输入你的名字')
print('1:水瓶')
print('2:双鱼')
print('3:白羊')
print('4:金牛')
print('5:双子')
print('6:巨蟹')
print('7:狮子')
print('8:处女')
B = int(input('请输入编码'))
if B == 1:
    print('%s,您好！水瓶座的您分析结果:1月20~2月18，性格开朗'%A)
if B == 2:
    print('%s,您好！双鱼座的您分析结果:2月19~3月20，性格外向'%A)
if B == 3:
    print('%s,您好！白羊座的您分析结果:3月21~4月19，性格活泼'%A)
if B == 4:
    print('%s,您好！金牛座的您分析结果:4月20~5月20，性格内向'%A)
if B == 5:
    print('%s,您好！双子座的您分析结果:5月21~6月21，性格深沉'%A)
if B == 6:
    print('%s,您好！巨蟹座的您分析结果:6月21~7月22，性格健谈'%A)
if B == 7:
    print('%s,您好！狮子座的您分析结果:7月23~8月22，性格积极'%A)
if B ==8:
    print('%s,您好！处女座的您分析结果:8月23~9月22，性格友善'%A)



