print('定制自己的手机套餐：')
print('A.请设置通话时长：')
A = [(1,'0分钟'),(2,'50分钟'),(3,'100分钟'),(4,'300分钟'),(5,'不限量')]
for i in A:
    print('%d.%s'%(i[0],i[1]))
num1 =int(input('请选择通话时间编码号：'))
print('B.请设置流量：')
B = [(1,'0M'),(2,'500M'),(3,'1G'),(4,'5G'),(5,'不限量')]
for i in B:
    print('%d.%s'%(i[0],i[1]))
num2 =int(input('输入流量编码：'))
print("C.请设置短信条数：")
C =[(1,'0条'),(2,'50条'),(3,'100条')]
for i in C:
    print('%d.%s'%(i[0],i[1]))
num3 =int(input('请输入选择流量编号：'))
print('您的手机套餐定制成功:通话时间长为%s/月，流量%s/月，短信为%s/月'%(A[num1-1][1],B[num2-1][1],C[num3-1][1]))

